=== Using the REPL ===
Get familiar with the Interactive REPL (Read-Eval-Print Loop).
The REPL shows results immediately. Experiment!
Try these expressions:

```
> 5 + 7
> 8 / 4
> True && False
> not (False && True)
> 7 == 7
> 5 /= 5
> 5 /= 6
> "hello" == "world"
> min 64 128
> max 128 64
> mod 14 3
> mod 14 3 == 0
> div 14 3
> max "apple" "banana"
> (2 == 3) || (2 == 2)
> ord "A"
> chr 98
```

What is the purpose of `&&` and `||` ?

What does `/=` mean?

What is the significance of `ord` and `chr` ?

What do `mod` and `div` do? Try different values to help you decide.

=== Variables ===
In the REPL define some Variables
```
> x = 7
> y = 2
> myValue = 17
> mySecondValue = -12
```
You can use these variables as numbers in expressions. Try the following, and some of your own:
```
> myValue + 3
> y - mySecondValue
> y == 7
> y == 2
> myValue < 15
> not (myValue > 15)
> myNewValue = x + y
> myNewValue + 11
```
What happens if you now try
```
> myValue = 10
```
In functional programming variables and other data structures are **_immutable_**. This means that the values stored in them cannot be changed after being created.

This is particularly important when working with **_Big Data_**: Big Data is distributed across multiple devices, so immutability ensures that values stored cannot be changed after being created, preventing conflicts when multiple devices process the same data simultaneously.

You can use the **RESET** button in the REPL to clear the output as well as clear any variable definitions.

=== Simple Functions ===
In the REPL type the following:
```
> add x y = x + y
```
then try the following ...
```
> add 4 5
> add -6 7
```
`add` is the **identifier** (name of the function).
`x` `y` are the **parameters** of the function.
`= x + y` defines what the function does.


When we type 
```
> add 4 5
```
the `4` and `5` are the **arguments** that are passed into the **parameters** `x` and `y`.


Now write functions to perform the following tasks:

`tripleMe` - Accepts one parameter and returns three times its value.
Example:
```
> tripleMe 5
15
```

`doubleAdd` - Accepts two parameters, doubles each of them, then adds them together.
Example:
```
> doubleAdd 3 4
14
```

`subtractThenDouble` - Accepts two parameters, subtracts the second from the first, then doubles the result.
Example:
```
> subtractThenDouble 10 3
14
```

`isGreaterThan100` - Accepts two parameters, adds them together, and returns `True` if the sum is greater than 100.
Example:
```
> isGreaterThan100 60 50
True
> isGreaterThan100 30 40
False
```

`averageTwo` - Accepts two parameters and returns their average.
Example:
```
> averageTwo 10 20
15
> averageTwo 7 8
7.5
```

`minutesToHours` - Accepts a number of minutes and returns how many complete hours. Use `div` for integer division.
Example:
```
> minutesToHours 150
2
> minutesToHours 90
1
```

`isEven` - Accepts one parameter and returns `True` if the number is even, `False` otherwise. Use `mod` to find the remainder.
Example:
```
> isEven 8
True
> isEven 7
False
```

